<?PHP
    /*
     | Submail addressbook/message/subscribe API demo
     | SUBMAIL SDK Version 2.6 --PHP
     | copyright 2011 - 2017 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 ADDRESSBOOKMessage 类
     |--------------------------------------------------------------------------
     */
    
    $addressbook=new ADDRESSBOOKMessage($message_configs);
    
    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置订阅的联系人11位手机号码
     |--------------------------------------------------------------------------
     */
    
    $addressbook->setAddress('1**********');
    
    /*
     |可选参数
     |--------------------------------------------------------------------------
     |设置目标地址薄标识，将联系人添加到目标地址薄
     |默认值为 subscribe 即订阅地址薄
     |--------------------------------------------------------------------------
     */
    
    $addressbook->setAddressbook('subscribe');
    
    /*
     |调用 subscribe 方法添加联系人
     |--------------------------------------------------------------------------
     */
    
    $subscribe=$addressbook->subscribe();
    
    /*
     |打印服务器返回码
     |--------------------------------------------------------------------------
     */
    
    print_r($subscribe);
