<?PHP
    /*
     | Submail message/xsend API demo
     | SUBMAIL SDK Version 2.3 --PHP
     | copyright 2011 - 2016 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 MESSAGETemplateGET 类 (获取短信模板)
     |--------------------------------------------------------------------------
     */
    
    $submail=new MESSAGETemplateGET($message_configs);
    
    
    /*
     |可选参数
     |--------------------------------------------------------------------------
     |设置需要获取短信模板ID，舍弃该参数，API将返回账户下最新的1000条短信模板
     |--------------------------------------------------------------------------
     */
    
    $submail->SetTemplate('AiLO2');
    
    
    /*
     |调用 getTemplate 方法获取短信模板
     |--------------------------------------------------------------------------
     */
    
    $templates=$submail->getTemplate();
    
    
    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */
    
    print_r($templates);
