<?PHP
    /*
     | Submail message/send API demo
     | SUBMAIL SDK Version 2.6 --PHP
     | copyright 2011 - 2017 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 MESSAGEXsend 类
     |--------------------------------------------------------------------------
     */
    
    $submail=new MESSAGEsend($message_configs);
    
    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置短信接收的11位手机号码
     |--------------------------------------------------------------------------
     */
    
    $submail->setTo('186********');
    
    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置短信正文
     |短信正文必须提交一个短信签名，该签名必须使用全角大括号"【"和"】"包含，切该签名必须放在您短信正文的最前端
     |您提交的短信正文，需要在SUBMAIL-》短信-》新建页面提交模板审核后才可以发送，如果 API 返回 420 错误，可判断为没有匹配到模板
     |例：【SUBMAIL】您的短信验证码：4438，请在10分钟内输入。
     |模板匹配机制：缓存+模板计算相似度模式
     |--------------------------------------------------------------------------
     */
    
    $submail->SetContent('【SUBMAIL】您的短信验证码：4438，请在10分钟内输入。');
    

    /*
     |调用 send 方法发送短信
     |--------------------------------------------------------------------------
     */
    
    $send=$submail->send();
    
    
    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */
    
    print_r($send);