<?PHP
    /*
     | Submail message/xsend API demo
     | SUBMAIL SDK Version 2.6 --PHP
     | copyright 2011 - 2017 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 MESSAGETemplateDELETE 类 (删除短信模板)
     |--------------------------------------------------------------------------
     */
    
    $submail=new MESSAGETemplateDELETE($message_configs);
    
    /*
     |必须参数
     |--------------------------------------------------------------------------
     |设置需要更新短信模板ID
     |--------------------------------------------------------------------------
     */
    
    $submail->SetTemplate('yOHYE1');
    

    /*
     |调用 deleteTemplate 删除短信模板（注意，此操作将无法恢复）
     |--------------------------------------------------------------------------
     */
    
    $templates=$submail->deleteTemplate();
    
    
    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */
    
    print_r($templates);
