<?PHP
    /*
     | Submail message/xsend API demo
     | SUBMAIL SDK Version 2.3 --PHP
     | copyright 2011 - 2016 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 MESSAGETemplatePUT 类 (更新短信模板)
     |--------------------------------------------------------------------------
     */
    
    $submail=new MESSAGETemplatePUT($message_configs);
    
    /*
     |必须参数
     |--------------------------------------------------------------------------
     |设置需要更新短信模板ID
     |--------------------------------------------------------------------------
     */
    
    $submail->SetTemplate('yOHYE1');
    
    /*
     |可选参数
     |--------------------------------------------------------------------------
     |设置短信模板标题（仅可作为标记短信用途，非必须参数，64个字符以内）
     |--------------------------------------------------------------------------
     */
    
    $submail->SetTitle('验证码短信模板(PUT 方法测试)');
    
    /*
     |必须参数
     |--------------------------------------------------------------------------
     |设置短信模板签名，请使用您的公司名或应用、APP、网站名作为您的短信签名，请将签名字数控制在2-10个字符以内，并使用全角大括号“【”和“】”包括，如:“【SUBMAIL】”
     |--------------------------------------------------------------------------
     */
    
    $submail->SetSignature('【SUBMAIL】');
    
    /*
     |必须参数
     |--------------------------------------------------------------------------
     |设置短信模板内容，请将模板正文字数控制在256个字符以内。可使用文本变量 参阅 了解如何创建和使用文本变量：http://submail.cn/chs/documents/developer#/oKraS3
     |--------------------------------------------------------------------------
     */
    
    $submail->SetContent('您的验证码：@var(code)，请在@var(time)分钟内输入，如非本人操作请忽略。');
    
    /*
     |调用 putTemplate 更新短信模板并重新提交至 SUBMAIL 后台审核
     |--------------------------------------------------------------------------
     */
    
    $templates=$submail->putTemplate();
    
    
    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */
    
    print_r($templates);
