<?PHP
    /*
     | Submail voice/send API demo
     | SUBMAIL SDK Version 2.6 --PHP
     | copyright 2011 - 2017 SUBMAIL
     |--------------------------------------------------------------------------
     */
    
    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';
    
    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */
    
    require_once('../SUBMAILAutoload.php');
    
    /*
     |初始化 MESSAGEXsend 类
     |--------------------------------------------------------------------------
     */
    
    $submail=new VOICEsend($voice_configs);
    
    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置语音通知接收的11位手机号码
     |--------------------------------------------------------------------------
     */
    
    $submail->setTo('15*********');
    
    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置语音通知正文
     |语音通知正文必须提交一个语音通知签名，该签名必须使用全角大括号"【"和"】"包含，切该签名必须放在您语音通知正文的最前端
     |您提交的语音通知正文，需要在SUBMAIL-》语音-》创建/管理语音通知模板 页面提交模板审核后才可以发送，如果 API 返回 420 错误，可判断为没有匹配到模板
     |例：亲爱的顾客，快递员：@var(name)，因@var(reson)，已将您的快递包裹送至您小区的物业，请您及时取回，感谢您的惠顾
     |模板匹配机制：缓存+模板计算相似度模式
     |--------------------------------------------------------------------------
     */
    
    $submail->SetContent('亲爱的顾客，快递员：xxx，因无法进入单元，已将您的快递包裹送至您小区的物业，请您及时取回，感谢您的惠顾 ');
    
    
    /*
     |调用 send 方法发送语音通知
     |--------------------------------------------------------------------------
     */
    
    $xsend=$submail->send();
    
    
    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */
    
    print_r($xsend);
